var weekDayI10n = {
		'be':['Па' ,'Аў' ,'Ср' ,'Ча' ,'Пя' ,'Су' ,'Ня' ],
		'pl':['Po' ,'Wt' ,'Śr' ,'Cz' ,'Pi' ,'So' ,'Ni' ],
		'ru':['По' ,'Вт' ,'Ср' ,'Че' ,'Пя' ,'Су' ,'Во' ],
		'uk':['По' ,'Ві' ,'Се' ,'Че' ,'Пя' ,'Су' ,'Не' ],

		'ca':['Dil','Dim','Dim','Dij','Div','Dis','Diu'],
		'es':['Lu' ,'Ma' ,'Mi' ,'Ju' ,'Vi' ,'Sá' ,'Do' ],
		'fr':['Lu' ,'Ma' ,'Me' ,'Je' ,'Ve' ,'Sa' ,'Di' ],
		'it':['Lu' ,'Ma' ,'Me' ,'Gi' ,'Ve' ,'Sa' ,'Do' ],
		'pt':['Seg','Ter','Qua','Qui','Sex','Sáb','Dom'],
		'ro':['Lu' ,'Ma' ,'Mi' ,'Jo' ,'Vi' ,'Sâ' ,'Du' ],

		'da':['Ma' ,'Ti' ,'On' ,'To' ,'Fr' ,'Lø' ,'Sø' ],
		'de':['Mo' ,'Di' ,'Mi' ,'Do' ,'Fr' ,'Sa' ,'So' ],
		'en':['Mo' ,'Tu' ,'We' ,'Th' ,'Fr' ,'Sa' ,'Su' ],
		'no':['Ma' ,'Ti' ,'On' ,'To' ,'Fr' ,'Lø' ,'Sø' ],
		'sv':['Må' ,'Ti' ,'On' ,'To' ,'Fr' ,'Lö' ,'Sö' ],
		
		'el':['Δε' ,'Τρ' ,'Τε' ,'Πέ' ,'Πα' ,'Σά' ,'Κυ' ],

		'fi':['Ma' ,'Ti' ,'Ke' ,'To' ,'Pe' ,'La' ,'Su' ],
		'et':['Es' ,'Te' ,'Ko' ,'Ne' ,'Re' ,'La' ,'Pü' ],

		'ja' : ['月','火','水','木','金','土','日'],
		'zh' : ['一','二','三','四','五','六','日'],

};